SwiperWitty/Core-Caven32/Caven-V3.14-M0+/HC32L110/User/.pack/HDSC/HC32L110.1.0.3/Device/Include/HC32L110B.h
#define M0P_ADC                                ((M0P_ADC_TypeDef *)0x40002400UL)
#define M0P_ADT0                               ((M0P_ADT_TypeDef *)0x40003000UL)
#define M0P_ADT1                               ((M0P_ADT_TypeDef *)0x40003400UL)
#define M0P_ADT2                               ((M0P_ADT_TypeDef *)0x40003800UL)
#define M0P_BGR                                ((M0P_BGR_TypeDef *)0x40002400UL)
#define M0P_BT0                                ((M0P_BT_TypeDef *)0x40000C00UL)
#define M0P_BT1                                ((M0P_BT_TypeDef *)0x40000C20UL)
#define M0P_BT2                                ((M0P_BT_TypeDef *)0x40000C40UL)
#define M0P_CLK_TRIM                           ((M0P_CLK_TRIM_TypeDef *)0x40001800UL)
#define M0P_CLOCK                              ((M0P_CLOCK_TypeDef *)0x40002000UL)
#define M0P_CRC                                ((M0P_CRC_TypeDef *)0x40020900UL)
#define M0P_FLASH                              ((M0P_FLASH_TypeDef *)0x40020000UL)
#define M0P_GPIO                               ((M0P_GPIO_TypeDef *)0x40020C00UL)
#define M0P_I2C                                ((M0P_I2C_TypeDef *)0x40000400UL)
#define M0P_LPTIMER                            ((M0P_LPTIMER_TypeDef *)0x40000C00UL)
#define M0P_LPUART                             ((M0P_LPUART_TypeDef *)0x40000200UL)
#define M0P_LVD                                ((M0P_LVD_TypeDef *)0x40002400UL)
#define M0P_PCA                                ((M0P_PCA_TypeDef *)0x40001000UL)
#define M0P_RAM                                ((M0P_RAM_TypeDef *)0x40020400UL)
#define M0P_RESET                              ((M0P_RESET_TypeDef *)0x4000201CUL)
#define M0P_RTC                                ((M0P_RTC_TypeDef *)0x40001400UL)
#define M0P_SPI                                ((M0P_SPI_TypeDef *)0x40000800UL)
#define M0P_UART0                              ((M0P_UART_TypeDef *)0x40000000UL)
#define M0P_UART1                              ((M0P_UART_TypeDef *)0x40000100UL)
#define M0P_VC                                 ((M0P_VC_TypeDef *)0x40002400UL)
#define M0P_WDT                                ((M0P_WDT_TypeDef *)0x40000C00UL)


#ifdef __cplusplus
}
#endif

#endif /* __HC32L110B_H__ */

